#### query()

To query the rows or the columns based on the expression (single or multiple column conditions) provided and returns a new DataFrame

Columns names must not have empty spaces.

`expr` â€“ expression takes conditions to query rows

In [32]:
import pandas as pd
df = pd.DataFrame({'A': range(1, 6),
                   'B': range(10, 0, -2),
                   'C_C': range(10, 5, -1)})
df

   A   B  C_C
0  1  10   10
1  2   8    9
2  3   6    8
3  4   4    7
4  5   2    6

In [14]:
# Querying rows with a specific value
df.query('A > 2 ')

   A  B  C_C
2  3  6    8
3  4  4    7
4  5  2    6

In [13]:
# Multiple conditions
df.query('A > 2 and C_C > 7')

   A  B  C_C
2  3  6    8

In [23]:
# 'not' Operator 
df.query('~(A > 2)')
# equivalent to df.query('not(A > 2)')

   A   B  C_C
0  1  10   10
1  2   8    9

In [36]:
# math operations 
df.query('B/2 > 3')

   A   B  C_C
0  1  10   10
1  2   8    9

In [52]:
# Use of inbuilt funcitons like sqrt(), abs()
df.query('sqrt(C_C) > 2.85')

   A   B  C_C
0  1  10   10
1  2   8    9

In [57]:
# looking through date_time data
df["Date"] = pd.date_range(start="2021-04-05", periods=5, freq="M")

df.query('Date.dt.month >= 6')

   A  B  C_C       Date
2  3  6    8 2021-06-30
3  4  4    7 2021-07-31
4  5  2    6 2021-08-31

In [63]:
# Querying based on conditions of comparing between two columns or more columns
df.query('A + B < C_C')

Empty DataFrame
Columns: [A, B, C_C, Date]
Index: []

In [ ]:
#